[{"document_id": "bce2b024-fec2-4846-bd5a-b897c3574901", "data": {"original_path": "documents/bce2b024-fec2-4846-bd5a-b897c3574901_original.docx", "problematic_clauses": [{"index": 0, "text": "Max Muster", "score": 0.586737871170044}, {"index": 1, "text": "Dear Max Muster:", "score": 0.6389189958572388}, {"index": 2, "text": "We understand that the undersigned party (referred to as “you” or “your,” as appropriate) is interested in exploring a possible negotiated transaction with Company X (d/b/a Company X) (the “Company” and such possible negotiated transaction involving you and the Company or its affiliates, a “Strategic Transaction”).  In that connection, you have requested certain information from the Company and its representatives, including Moelis & Company, the Company’s financial advisor on this matter (the “Financial Advisor”), pursuant to and subject to the terms set forth in this letter agreement (the “Agreement”).", "score": 0.6687763929367065}, {"index": 3, "text": "Maxime Muster", "score": 0.6447895765304565}, {"index": 4, "text": "Max Muster", "score": 0.586737871170044}], "suggestions": [{"index": 0, "original": "Max Muster", "suggested": "SUGGESTED CHANGE: Max Muster [This clause has been identified as potentially problematic and should be reviewed]", "reason": "This clause may contain terms that are unfavorable or legally problematic."}, {"index": 1, "original": "Dear Max Muster:", "suggested": "SUGGESTED CHANGE: Dear Max Muster: [This clause has been identified as potentially problematic and should be reviewed]", "reason": "This clause may contain terms that are unfavorable or legally problematic."}, {"index": 2, "original": "We understand that the undersigned party (referred to as “you” or “your,” as appropriate) is interested in exploring a possible negotiated transaction with Company X (d/b/a Company X) (the “Company” and such possible negotiated transaction involving you and the Company or its affiliates, a “Strategic Transaction”).  In that connection, you have requested certain information from the Company and its representatives, including Moelis & Company, the Company’s financial advisor on this matter (the “Financial Advisor”), pursuant to and subject to the terms set forth in this letter agreement (the “Agreement”).", "suggested": "SUGGESTED CHANGE: We understand that the undersigned party (referred to as “you” or “your,” as appropriate) is interested in exploring a possible negotiated transaction with Company X (d/b/a Company X) (the “Company” and such possible negotiated transaction involving you and the Company or its affiliates, a “Strategic Transaction”).  In that connection, you have requested certain information from the Company and its representatives, including Moelis & Company, the Company’s financial advisor on this matter (the “Financial Advisor”), pursuant to and subject to the terms set forth in this letter agreement (the “Agreement”). [This clause has been identified as potentially problematic and should be reviewed]", "reason": "This clause may contain terms that are unfavorable or legally problematic."}, {"index": 3, "original": "Maxime Muster", "suggested": "SUGGESTED CHANGE: Maxime Muster [This clause has been identified as potentially problematic and should be reviewed]", "reason": "This clause may contain terms that are unfavorable or legally problematic."}, {"index": 4, "original": "Max Muster", "suggested": "SUGGESTED CHANGE: Max Muster [This clause has been identified as potentially problematic and should be reviewed]", "reason": "This clause may contain terms that are unfavorable or legally problematic."}], "redline_path": "documents/bce2b024-fec2-4846-bd5a-b897c3574901_redline.docx"}, "timestamp": "2025-05-20 18:55:21.820698"}, {"document_id": "98e2a7f0-691f-4319-9955-6541f791a367", "data": {"original_path": "documents/98e2a7f0-691f-4319-9955-6541f791a367_original.docx", "problematic_clauses": [{"index": 0, "text": "Max Muster", "score": 0.5946933627128601}, {"index": 1, "text": "Dear Max Muster:", "score": 0.5085480213165283}, {"index": 2, "text": "We understand that the undersigned party (referred to as “you” or “your,” as appropriate) is interested in exploring a possible negotiated transaction with Company X (d/b/a Company X) (the “Company” and such possible negotiated transaction involving you and the Company or its affiliates, a “Strategic Transaction”).  In that connection, you have requested certain information from the Company and its representatives, including Moelis & Company, the Company’s financial advisor on this matter (the “Financial Advisor”), pursuant to and subject to the terms set forth in this letter agreement (the “Agreement”).", "score": 0.5117753744125366}, {"index": 3, "text": "You hereby agree as follows:", "score": 0.5423139929771423}, {"index": 5, "text": "Max Muster", "score": 0.5946933627128601}], "suggestions": [{"index": 0, "original": "Max Muster", "suggested": "SUGGESTED CHANGE: Max Muster [This clause has been identified as potentially problematic and should be reviewed]", "reason": "This clause may contain terms that are unfavorable or legally problematic."}, {"index": 1, "original": "Dear Max Muster:", "suggested": "SUGGESTED CHANGE: Dear Max Muster: [This clause has been identified as potentially problematic and should be reviewed]", "reason": "This clause may contain terms that are unfavorable or legally problematic."}, {"index": 2, "original": "We understand that the undersigned party (referred to as “you” or “your,” as appropriate) is interested in exploring a possible negotiated transaction with Company X (d/b/a Company X) (the “Company” and such possible negotiated transaction involving you and the Company or its affiliates, a “Strategic Transaction”).  In that connection, you have requested certain information from the Company and its representatives, including Moelis & Company, the Company’s financial advisor on this matter (the “Financial Advisor”), pursuant to and subject to the terms set forth in this letter agreement (the “Agreement”).", "suggested": "SUGGESTED CHANGE: We understand that the undersigned party (referred to as “you” or “your,” as appropriate) is interested in exploring a possible negotiated transaction with Company X (d/b/a Company X) (the “Company” and such possible negotiated transaction involving you and the Company or its affiliates, a “Strategic Transaction”).  In that connection, you have requested certain information from the Company and its representatives, including Moelis & Company, the Company’s financial advisor on this matter (the “Financial Advisor”), pursuant to and subject to the terms set forth in this letter agreement (the “Agreement”). [This clause has been identified as potentially problematic and should be reviewed]", "reason": "This clause may contain terms that are unfavorable or legally problematic."}, {"index": 3, "original": "You hereby agree as follows:", "suggested": "SUGGESTED CHANGE: You hereby agree as follows: [This clause has been identified as potentially problematic and should be reviewed]", "reason": "This clause may contain terms that are unfavorable or legally problematic."}, {"index": 5, "original": "Max Muster", "suggested": "SUGGESTED CHANGE: Max Muster [This clause has been identified as potentially problematic and should be reviewed]", "reason": "This clause may contain terms that are unfavorable or legally problematic."}], "redline_path": "documents/98e2a7f0-691f-4319-9955-6541f791a367_redline.docx"}, "timestamp": "2025-05-20 18:59:45.476562"}, {"document_id": "316abcce-459e-4eac-8035-01303c987623", "data": {"original_path": "documents/316abcce-459e-4eac-8035-01303c987623_original.docx", "problematic_clauses": [{"index": 0, "text": "Max Muster", "score": 0.7751292586326599}, {"index": 1, "text": "Dear Max Muster:", "score": 0.6188069581985474}, {"index": 3, "text": "You hereby agree as follows:", "score": 0.6966633796691895}, {"index": 5, "text": "Max Muster", "score": 0.7751292586326599}], "suggestions": [{"index": 0, "original": "Max Muster", "suggested": "SUGGESTED CHANGE: Max Muster [This clause has been identified as potentially problematic and should be reviewed]", "reason": "This clause may contain terms that are unfavorable or legally problematic."}, {"index": 1, "original": "Dear Max Muster:", "suggested": "SUGGESTED CHANGE: Dear Max Muster: [This clause has been identified as potentially problematic and should be reviewed]", "reason": "This clause may contain terms that are unfavorable or legally problematic."}, {"index": 3, "original": "You hereby agree as follows:", "suggested": "SUGGESTED CHANGE: You hereby agree as follows: [This clause has been identified as potentially problematic and should be reviewed]", "reason": "This clause may contain terms that are unfavorable or legally problematic."}, {"index": 5, "original": "Max Muster", "suggested": "SUGGESTED CHANGE: Max Muster [This clause has been identified as potentially problematic and should be reviewed]", "reason": "This clause may contain terms that are unfavorable or legally problematic."}], "redline_path": "documents/316abcce-459e-4eac-8035-01303c987623_redline.docx"}, "timestamp": "2025-05-20 19:02:42.971897"}, {"document_id": "8d3937d9-6a6f-4025-afca-f86f9efe0b5d", "data": {"original_file": "documents/8d3937d9-6a6f-4025-afca-f86f9efe0b5d.docx", "redline_file": "documents/8d3937d9-6a6f-4025-afca-f86f9efe0b5d_redline.docx", "suggestions": [{"index": 2, "original": "Max Muster", "suggested": "SUGGESTED CHANGE: Max Muster [This clause has been identified as potentially problematic and should be reviewed]", "reason": "This clause may contain terms that are unfavorable or legally problematic."}, {"index": 4, "original": "Tumbelenstrasse 20", "suggested": "SUGGESTED CHANGE: Tumbelenstrasse 20 [This clause has been identified as potentially problematic and should be reviewed]", "reason": "This clause may contain terms that are unfavorable or legally problematic."}, {"index": 9, "original": "Evaluation Material. All oral and written (both hard copy and electronic) information concerning the Company, any predecessor entity or any subsidiary or other affiliate of the Company which is furnished or made available to you and your Representatives (as defined below) either before, on or after the date of this Agreement, together with analyses, compilations, studies, summaries, extracts or other documents or records prepared by you or your Representatives which contain or otherwise reflect or are generated from such information, are collectively referred to herein as the “Evaluation Material.” You acknowledge that the Evaluation Material may include information in oral or in written format, graphic or machine readable form, and may include, without limitation, information concerning the Company, its subsidiaries, affiliates or their respective equityholders and their respective businesses, financial structure, financial or business plans or strategies, revenues, earnings or profits, executives, employees, products, intellectual property, content, information technology or infrastructure.  Notwithstanding the foregoing, “Evaluation Material” does not include any information that you can demonstrate by written records (a) is or becomes a matter of public knowledge, except as a result of any disclosure by you or any of your Representatives in breach of this Agreement, (b) was available to you on a non-confidential basis from a source that is not and was not prohibited from disclosing such information to you by a contractual, legal or fiduciary obligation; (c) is disclosed by you or your Representatives with the Company’s prior written approval; or (d) is independently developed by you or your Representatives without use of Evaluation Material.", "suggested": "SUGGESTED CHANGE: Evaluation Material. All oral and written (both hard copy and electronic) information concerning the Company, any predecessor entity or any subsidiary or other affiliate of the Company which is furnished or made available to you and your Representatives (as defined below) either before, on or after the date of this Agreement, together with analyses, compilations, studies, summaries, extracts or other documents or records prepared by you or your Representatives which contain or otherwise reflect or are generated from such information, are collectively referred to herein as the “Evaluation Material.” You acknowledge that the Evaluation Material may include information in oral or in written format, graphic or machine readable form, and may include, without limitation, information concerning the Company, its subsidiaries, affiliates or their respective equityholders and their respective businesses, financial structure, financial or business plans or strategies, revenues, earnings or profits, executives, employees, products, intellectual property, content, information technology or infrastructure.  Notwithstanding the foregoing, “Evaluation Material” does not include any information that you can demonstrate by written records (a) is or becomes a matter of public knowledge, except as a result of any disclosure by you or any of your Representatives in breach of this Agreement, (b) was available to you on a non-confidential basis from a source that is not and was not prohibited from disclosing such information to you by a contractual, legal or fiduciary obligation; (c) is disclosed by you or your Representatives with the Company’s prior written approval; or (d) is independently developed by you or your Representatives without use of Evaluation Material. [This clause has been identified as potentially problematic and should be reviewed]", "reason": "This clause may contain terms that are unfavorable or legally problematic."}, {"index": 10, "original": "Permitted Use. You shall use the Evaluation Material solely for the purpose of evaluating the Strategic Transaction and you shall keep the Evaluation Material confidential, except that you may disclose the Evaluation Material or portions thereof to those of your directors, officers and employees, agents and advisors (including attorneys, accountants, consultants and financial advisors) (collectively, “Representatives”) who need to know such information for the purpose of evaluating the Strategic Transaction; provided that, except pursuant to Section 3 below, in no event shall you disclose any Evaluation Material to any Representative) unless such receiving party acknowledges and agrees that it has an obligation to protect Evaluation Material that is at least the same degree of care as required by you pursuant to this Agreement.  You shall take, at your own expense, all actions necessary to restrain your Representatives from making any use or disclosure of any Evaluation Material in breach of this Agreement, and you shall be responsible for any breach of this Agreement by your Representatives.  You agree to use, and to require your Representatives to use, at least the same degree of care that you use to protect your own highly confidential information from unauthorized disclosure, but in no event less than a reasonable degree of care.  You shall notify the Company in writing immediately upon discovery of any unauthorized use or disclosure of Evaluation Material or any other breach of this Agreement and will reasonably cooperate with the Company to regain possession of Evaluation Material and prevent any further unauthorized disclosure or use.  ", "suggested": "SUGGESTED CHANGE: Permitted Use. You shall use the Evaluation Material solely for the purpose of evaluating the Strategic Transaction and you shall keep the Evaluation Material confidential, except that you may disclose the Evaluation Material or portions thereof to those of your directors, officers and employees, agents and advisors (including attorneys, accountants, consultants and financial advisors) (collectively, “Representatives”) who need to know such information for the purpose of evaluating the Strategic Transaction; provided that, except pursuant to Section 3 below, in no event shall you disclose any Evaluation Material to any Representative) unless such receiving party acknowledges and agrees that it has an obligation to protect Evaluation Material that is at least the same degree of care as required by you pursuant to this Agreement.  You shall take, at your own expense, all actions necessary to restrain your Representatives from making any use or disclosure of any Evaluation Material in breach of this Agreement, and you shall be responsible for any breach of this Agreement by your Representatives.  You agree to use, and to require your Representatives to use, at least the same degree of care that you use to protect your own highly confidential information from unauthorized disclosure, but in no event less than a reasonable degree of care.  You shall notify the Company in writing immediately upon discovery of any unauthorized use or disclosure of Evaluation Material or any other breach of this Agreement and will reasonably cooperate with the Company to regain possession of Evaluation Material and prevent any further unauthorized disclosure or use.   [This clause has been identified as potentially problematic and should be reviewed]", "reason": "This clause may contain terms that are unfavorable or legally problematic."}, {"index": 11, "original": "Required Disclosure. If you or any of your Representatives is required (by deposition, interrogatory, request for documents, subpoena, civil investigative demand or similar process) to disclose any of the Evaluation Material, you shall provide the Company with prior written notice of such requirement as soon as practicable after learning of it, shall furnish only that portion of the Evaluation Material which you are advised by counsel is legally required and only in the manner legally required, and shall exercise your best efforts to obtain assurance that confidential treatment will be accorded such Evaluation Material.  In addition, you acknowledge that the Company Parties (as defined below) may also take steps as they deem necessary to obtain such assurance.  By making Evaluation Material or other information available to you or your Representatives, the Company Parties are not, and shall not be deemed to be, granting (expressly or by implication) to you or your Representatives any license or other right under or with respect to any patent, trade secret, copyright, trademark or other proprietary or intellectual property right.  For purposes of this Agreement, the term “Company Parties” will be deemed to refer to the Company and each of its affiliates, representatives (including the Financial Advisor), equityholders, directors, officers, and employees", "suggested": "SUGGESTED CHANGE: Required Disclosure. If you or any of your Representatives is required (by deposition, interrogatory, request for documents, subpoena, civil investigative demand or similar process) to disclose any of the Evaluation Material, you shall provide the Company with prior written notice of such requirement as soon as practicable after learning of it, shall furnish only that portion of the Evaluation Material which you are advised by counsel is legally required and only in the manner legally required, and shall exercise your best efforts to obtain assurance that confidential treatment will be accorded such Evaluation Material.  In addition, you acknowledge that the Company Parties (as defined below) may also take steps as they deem necessary to obtain such assurance.  By making Evaluation Material or other information available to you or your Representatives, the Company Parties are not, and shall not be deemed to be, granting (expressly or by implication) to you or your Representatives any license or other right under or with respect to any patent, trade secret, copyright, trademark or other proprietary or intellectual property right.  For purposes of this Agreement, the term “Company Parties” will be deemed to refer to the Company and each of its affiliates, representatives (including the Financial Advisor), equityholders, directors, officers, and employees [This clause has been identified as potentially problematic and should be reviewed]", "reason": "This clause may contain terms that are unfavorable or legally problematic."}, {"index": 12, "original": "Return of Evaluation Material. If the Company so requests, you shall promptly, or in any event, within ten (10) days following such request, at the option of the Company, return to the Company all copies of Evaluation Material furnished to you or your Representatives by or on behalf of the Company or created by you or your Representatives that is in your possession or in the possession of your Representatives; provided, that you and your Representatives shall be permitted to retain a copy of any Evaluation Material to the extent (i) it is “backed-up” on electronic information management or communications systems or servers of you or your Representatives or (iii) that such retention is required by applicable law, regulation or bona fide document retention policy, and all such Evaluation Material that is so retained by you or your Representatives solely in accordance with this Agreement shall be held subject to the terms of this Agreement.  You agree to confirm in writing, if so requested by the Company, your compliance with the provisions of this paragraph once you have been requested to return and/or destroy all Evaluation Material.", "suggested": "SUGGESTED CHANGE: Return of Evaluation Material. If the Company so requests, you shall promptly, or in any event, within ten (10) days following such request, at the option of the Company, return to the Company all copies of Evaluation Material furnished to you or your Representatives by or on behalf of the Company or created by you or your Representatives that is in your possession or in the possession of your Representatives; provided, that you and your Representatives shall be permitted to retain a copy of any Evaluation Material to the extent (i) it is “backed-up” on electronic information management or communications systems or servers of you or your Representatives or (iii) that such retention is required by applicable law, regulation or bona fide document retention policy, and all such Evaluation Material that is so retained by you or your Representatives solely in accordance with this Agreement shall be held subject to the terms of this Agreement.  You agree to confirm in writing, if so requested by the Company, your compliance with the provisions of this paragraph once you have been requested to return and/or destroy all Evaluation Material. [This clause has been identified as potentially problematic and should be reviewed]", "reason": "This clause may contain terms that are unfavorable or legally problematic."}, {"index": 13, "original": "Publicity. Without the prior written consent of the Company, you shall not, and shall direct your Representatives not to, disclose to any person or entity (“Person”) (a) that any investigations, discussions or negotiations are taking place concerning a possible Strategic Transaction, (b) that you have requested or received any Evaluation Material or (c) any of the terms, conditions or other facts with respect to the Strategic Transaction or your possible participation in it, including the status thereof (clauses (a) through (c), “Transaction Information”).  You acknowledge and agree that such Transaction Information shall constitute Evaluation Material for purposes of this Agreement.", "suggested": "SUGGESTED CHANGE: Publicity. Without the prior written consent of the Company, you shall not, and shall direct your Representatives not to, disclose to any person or entity (“Person”) (a) that any investigations, discussions or negotiations are taking place concerning a possible Strategic Transaction, (b) that you have requested or received any Evaluation Material or (c) any of the terms, conditions or other facts with respect to the Strategic Transaction or your possible participation in it, including the status thereof (clauses (a) through (c), “Transaction Information”).  You acknowledge and agree that such Transaction Information shall constitute Evaluation Material for purposes of this Agreement. [This clause has been identified as potentially problematic and should be reviewed]", "reason": "This clause may contain terms that are unfavorable or legally problematic."}, {"index": 14, "original": "Coordination with Third Parties. You acknowledge and agree that, without the prior written consent of the Company, no Person who is a potential principal, co-investor, co-bidder or equity or debt financing source with respect to a possible Strategic Transaction, in each case, that is not controlled by or under common control with you, shall be considered your Representative for any purpose hereunder.  Without the Company’s prior written consent, you agree that you will not, directly or indirectly, solicit, coordinate with or otherwise partner with any other Person with respect to participating in the Strategic Transaction as a principal, co-investor, co-bidder or equity or debt financing source or enter into any agreement, arrangement or understanding with any other Person regarding such a Strategic Transaction.  You further agree that you will not, without the prior written consent of the Company, directly or indirectly, enter into any agreement, arrangement or understanding with any Person that has or would have the effect of requiring such Person to provide you or any of your affiliates or related parties with financing or other potential sources of capital on an exclusive basis in connection with a possible Strategic Transaction.", "suggested": "SUGGESTED CHANGE: Coordination with Third Parties. You acknowledge and agree that, without the prior written consent of the Company, no Person who is a potential principal, co-investor, co-bidder or equity or debt financing source with respect to a possible Strategic Transaction, in each case, that is not controlled by or under common control with you, shall be considered your Representative for any purpose hereunder.  Without the Company’s prior written consent, you agree that you will not, directly or indirectly, solicit, coordinate with or otherwise partner with any other Person with respect to participating in the Strategic Transaction as a principal, co-investor, co-bidder or equity or debt financing source or enter into any agreement, arrangement or understanding with any other Person regarding such a Strategic Transaction.  You further agree that you will not, without the prior written consent of the Company, directly or indirectly, enter into any agreement, arrangement or understanding with any Person that has or would have the effect of requiring such Person to provide you or any of your affiliates or related parties with financing or other potential sources of capital on an exclusive basis in connection with a possible Strategic Transaction. [This clause has been identified as potentially problematic and should be reviewed]", "reason": "This clause may contain terms that are unfavorable or legally problematic."}, {"index": 15, "original": "Non-Solicitation. For a period of four (4) year from the date hereof, you shall not, directly or indirectly, solicit or hire any employee of the Company or any of its subsidiaries with whom you have had contact during the period of your investigation of the Company and its business or whose identity you learned during such period; provided, that, the foregoing restrictions shall not apply to (a) solicitation through general advertising or other general solicitation not targeted to the employees of the Company (including through a search firm) or (b) solicitation with respect to, or hiring, any person whose employment with the Company or its subsidiaries has been terminated for a period of at least six (6) months at the time of such solicitation (or if no solicitation is made, at the time of such hiring).", "suggested": "SUGGESTED CHANGE: Non-Solicitation. For a period of four (4) year from the date hereof, you shall not, directly or indirectly, solicit or hire any employee of the Company or any of its subsidiaries with whom you have had contact during the period of your investigation of the Company and its business or whose identity you learned during such period; provided, that, the foregoing restrictions shall not apply to (a) solicitation through general advertising or other general solicitation not targeted to the employees of the Company (including through a search firm) or (b) solicitation with respect to, or hiring, any person whose employment with the Company or its subsidiaries has been terminated for a period of at least six (6) months at the time of such solicitation (or if no solicitation is made, at the time of such hiring). [This clause has been identified as potentially problematic and should be reviewed]", "reason": "This clause may contain terms that are unfavorable or legally problematic."}, {"index": 16, "original": "Direction of Requests. You hereby acknowledge and agree that all requests for information, tours and meetings, all questions or discussions relating to the procedures in making a proposal and all communications regarding the Strategic Transaction will be directed to the Financial Advisor.  You further acknowledge and agree that (i) the Company shall have no obligation to authorize or pursue any Strategic Transaction, (ii) the Company has not authorized or made any decision to pursue or engage in any Strategic Transaction and (iii) the Company reserves the right, in its sole and absolute discretion and without giving any reason therefor, to reject all proposals and to terminate discussions and negotiations, in each case at any time, regarding any Strategic Transaction.  This Agreement does not constitute or create any obligation of any of the Company Parties to provide any Evaluation Material or other information to you or your Representatives but merely defines the rights, duties and obligations of the parties with respect to Evaluation Material to the extent it may be disclosed or made available. In consideration for being provided access to Evaluation Material and the other agreements set forth herein, you waive any claims against the Company Parties arising out of or relating to the manner in which any Company Party conducts or pursues such a Strategic Transaction.", "suggested": "SUGGESTED CHANGE: Direction of Requests. You hereby acknowledge and agree that all requests for information, tours and meetings, all questions or discussions relating to the procedures in making a proposal and all communications regarding the Strategic Transaction will be directed to the Financial Advisor.  You further acknowledge and agree that (i) the Company shall have no obligation to authorize or pursue any Strategic Transaction, (ii) the Company has not authorized or made any decision to pursue or engage in any Strategic Transaction and (iii) the Company reserves the right, in its sole and absolute discretion and without giving any reason therefor, to reject all proposals and to terminate discussions and negotiations, in each case at any time, regarding any Strategic Transaction.  This Agreement does not constitute or create any obligation of any of the Company Parties to provide any Evaluation Material or other information to you or your Representatives but merely defines the rights, duties and obligations of the parties with respect to Evaluation Material to the extent it may be disclosed or made available. In consideration for being provided access to Evaluation Material and the other agreements set forth herein, you waive any claims against the Company Parties arising out of or relating to the manner in which any Company Party conducts or pursues such a Strategic Transaction. [This clause has been identified as potentially problematic and should be reviewed]", "reason": "This clause may contain terms that are unfavorable or legally problematic."}, {"index": 18, "original": "Compliance with Laws. You acknowledge your obligation to adhere to all applicable laws, regulations, and rules relating to the export of technical data, and shall not export or re-export any technical data, any products received from the Company or the direct product of such technical data to any proscribed country listed in such applicable laws, regulations and rules unless properly authorized.  All Evaluation Material (including all copies thereof) shall remain at all times the property of the Company Parties, and no property rights, license or other rights to any Evaluation Material or any information, data or other intellectual property set forth or referenced therein, is granted or implied hereby.  Nothing in this Agreement grants you any right to retain, distribute or commercialize any Evaluation Material.  ", "suggested": "SUGGESTED CHANGE: Compliance with Laws. You acknowledge your obligation to adhere to all applicable laws, regulations, and rules relating to the export of technical data, and shall not export or re-export any technical data, any products received from the Company or the direct product of such technical data to any proscribed country listed in such applicable laws, regulations and rules unless properly authorized.  All Evaluation Material (including all copies thereof) shall remain at all times the property of the Company Parties, and no property rights, license or other rights to any Evaluation Material or any information, data or other intellectual property set forth or referenced therein, is granted or implied hereby.  Nothing in this Agreement grants you any right to retain, distribute or commercialize any Evaluation Material.   [This clause has been identified as potentially problematic and should be reviewed]", "reason": "This clause may contain terms that are unfavorable or legally problematic."}, {"index": 19, "original": "Governing Law. This Agreement and all controversies arising from or relating to performance under this Agreement shall be governed by and construed in accordance with the laws of the State of Texas, without giving effect to its conflicts of laws principles.", "suggested": "SUGGESTED CHANGE: Governing Law. This Agreement and all controversies arising from or relating to performance under this Agreement shall be governed by and construed in accordance with the laws of the State of Texas, without giving effect to its conflicts of laws principles. [This clause has been identified as potentially problematic and should be reviewed]", "reason": "This clause may contain terms that are unfavorable or legally problematic."}, {"index": 20, "original": "Injunctive Relief. You hereby acknowledge and agree that money damages would not be a sufficient remedy for any breach or attempted breach of the provisions of this Agreement and that the Company Parties shall be entitled to equitable relief, including in the form of injunctions and orders for specific performance, for any such breach or attempted breach, in addition to all other remedies available to the Company Parties at law or in equity.  You hereby irrevocably and unconditionally consent to submit to the jurisdiction of the state and federal courts located in the State of Delaware for any actions, suits or proceedings arising out of or relating to this Agreement and the transactions contemplated hereby, and further agree that service of any process, summons, notice or document by U.S. registered mail to your address set forth above shall be effective service of process for any action, suit or proceeding brought against you in any such court.  You hereby irrevocably and unconditionally waive any objection to the laying of venue of any action, suit or proceeding arising out of this Agreement or the transactions contemplated hereby in the state and federal courts of the State of Delaware, and hereby further irrevocably and unconditionally waive and agree not to plead or claim in any such court that any such action, suit or proceeding brought in any such court has been brought in an inconvenient forum. If any litigation or other court action, arbitration or similar adjudicatory proceeding is commenced by any party to enforce its rights under this Agreement against any other party, all reasonable and documented fees, costs and expenses, including, without limitation, reasonable and documented attorneys’ fees and court costs, incurred by the prevailing party in such proceeding shall be reimbursed by the losing party, in each case as determined by a court of competent jurisdiction or other relevant authority in a final, non-appealable order; provided, that if a party to such proceeding prevails in part, and loses in part, the court, arbitrator or other adjudicator presiding over such proceeding shall award a reimbursement of the fees, costs and expenses incurred by such party on an equitable basis.", "suggested": "SUGGESTED CHANGE: Injunctive Relief. You hereby acknowledge and agree that money damages would not be a sufficient remedy for any breach or attempted breach of the provisions of this Agreement and that the Company Parties shall be entitled to equitable relief, including in the form of injunctions and orders for specific performance, for any such breach or attempted breach, in addition to all other remedies available to the Company Parties at law or in equity.  You hereby irrevocably and unconditionally consent to submit to the jurisdiction of the state and federal courts located in the State of Delaware for any actions, suits or proceedings arising out of or relating to this Agreement and the transactions contemplated hereby, and further agree that service of any process, summons, notice or document by U.S. registered mail to your address set forth above shall be effective service of process for any action, suit or proceeding brought against you in any such court.  You hereby irrevocably and unconditionally waive any objection to the laying of venue of any action, suit or proceeding arising out of this Agreement or the transactions contemplated hereby in the state and federal courts of the State of Delaware, and hereby further irrevocably and unconditionally waive and agree not to plead or claim in any such court that any such action, suit or proceeding brought in any such court has been brought in an inconvenient forum. If any litigation or other court action, arbitration or similar adjudicatory proceeding is commenced by any party to enforce its rights under this Agreement against any other party, all reasonable and documented fees, costs and expenses, including, without limitation, reasonable and documented attorneys’ fees and court costs, incurred by the prevailing party in such proceeding shall be reimbursed by the losing party, in each case as determined by a court of competent jurisdiction or other relevant authority in a final, non-appealable order; provided, that if a party to such proceeding prevails in part, and loses in part, the court, arbitrator or other adjudicator presiding over such proceeding shall award a reimbursement of the fees, costs and expenses incurred by such party on an equitable basis. [This clause has been identified as potentially problematic and should be reviewed]", "reason": "This clause may contain terms that are unfavorable or legally problematic."}, {"index": 21, "original": "No Waivers. No failure or delay by the any party in exercising any right, power or privilege hereunder will operate as a waiver thereof, nor will any single or partial exercise thereof preclude any other or further exercise thereof or the exercise of any other right, power or privilege hereunder.  ", "suggested": "SUGGESTED CHANGE: No Waivers. No failure or delay by the any party in exercising any right, power or privilege hereunder will operate as a waiver thereof, nor will any single or partial exercise thereof preclude any other or further exercise thereof or the exercise of any other right, power or privilege hereunder.   [This clause has been identified as potentially problematic and should be reviewed]", "reason": "This clause may contain terms that are unfavorable or legally problematic."}, {"index": 22, "original": "Amendment. This Agreement can only be modified or waived in writing executed by the Company and you; provided, that this Agreement shall not be subsequently limited or amended by any “clickthrough” agreement relating to the confidentiality of the Evaluation Material agreed to by you or your Representatives in connection with your or their access to any data site or virtual data room maintained in connection with the Strategic Transaction.", "suggested": "SUGGESTED CHANGE: Amendment. This Agreement can only be modified or waived in writing executed by the Company and you; provided, that this Agreement shall not be subsequently limited or amended by any “clickthrough” agreement relating to the confidentiality of the Evaluation Material agreed to by you or your Representatives in connection with your or their access to any data site or virtual data room maintained in connection with the Strategic Transaction. [This clause has been identified as potentially problematic and should be reviewed]", "reason": "This clause may contain terms that are unfavorable or legally problematic."}, {"index": 23, "original": "Term. This Agreement and all of the obligations under this Agreement shall terminate five (5) years from the date hereof.", "suggested": "SUGGESTED CHANGE: Term. This Agreement and all of the obligations under this Agreement shall terminate five (5) years from the date hereof. [This clause has been identified as potentially problematic and should be reviewed]", "reason": "This clause may contain terms that are unfavorable or legally problematic."}, {"index": 24, "original": "Successors and Assigns. This Agreement is for the benefit of the Company Parties and their successors and assigns.  In no event shall you assign any of your obligations hereunder without the Company’s prior written consent, and any attempted assignment without such consent shall be null and void.  ", "suggested": "SUGGESTED CHANGE: Successors and Assigns. This Agreement is for the benefit of the Company Parties and their successors and assigns.  In no event shall you assign any of your obligations hereunder without the Company’s prior written consent, and any attempted assignment without such consent shall be null and void.   [This clause has been identified as potentially problematic and should be reviewed]", "reason": "This clause may contain terms that are unfavorable or legally problematic."}, {"index": 25, "original": "[Signature Page Follows]", "suggested": "SUGGESTED CHANGE: [Signature Page Follows] [This clause has been identified as potentially problematic and should be reviewed]", "reason": "This clause may contain terms that are unfavorable or legally problematic."}, {"index": 26, "original": "If you agree with the foregoing, please sign this Agreement and return it to me, which shall thereupon constitute our Agreement with respect to the subject matter of this letter.", "suggested": "SUGGESTED CHANGE: If you agree with the foregoing, please sign this Agreement and return it to me, which shall thereupon constitute our Agreement with respect to the subject matter of this letter. [This clause has been identified as potentially problematic and should be reviewed]", "reason": "This clause may contain terms that are unfavorable or legally problematic."}, {"index": 28, "original": "Company X", "suggested": "SUGGESTED CHANGE: Company X [This clause has been identified as potentially problematic and should be reviewed]", "reason": "This clause may contain terms that are unfavorable or legally problematic."}, {"index": 29, "original": "By:\t\t", "suggested": "SUGGESTED CHANGE: By:\t\t [This clause has been identified as potentially problematic and should be reviewed]", "reason": "This clause may contain terms that are unfavorable or legally problematic."}, {"index": 35, "original": "By:\t\t", "suggested": "SUGGESTED CHANGE: By:\t\t [This clause has been identified as potentially problematic and should be reviewed]", "reason": "This clause may contain terms that are unfavorable or legally problematic."}, {"index": 36, "original": "Max Muster", "suggested": "SUGGESTED CHANGE: Max Muster [This clause has been identified as potentially problematic and should be reviewed]", "reason": "This clause may contain terms that are unfavorable or legally problematic."}], "original_filename": "nda1_original"}, "timestamp": "2025-05-20 20:41:45.994268"}, {"document_id": "d953b551-5f12-4b51-8cc9-2534331b6a76", "data": {"original_file": "documents/d953b551-5f12-4b51-8cc9-2534331b6a76.docx", "redline_file": "documents/d953b551-5f12-4b51-8cc9-2534331b6a76_redline.docx", "suggestions": [], "original_filename": "nda1_original", "clean_file": "documents/d953b551-5f12-4b51-8cc9-2534331b6a76_clean.docx"}, "timestamp": "2025-05-20 20:59:32.393426"}, {"document_id": "dc5baadd-ff21-4119-b426-0f4fcf16ae2b", "data": {"original_file": "documents/dc5baadd-ff21-4119-b426-0f4fcf16ae2b.docx", "redline_file": "documents/dc5baadd-ff21-4119-b426-0f4fcf16ae2b_redline.docx", "suggestions": [], "original_filename": "nda2_original"}, "timestamp": "2025-05-20 21:01:04.199923"}, {"document_id": "3193dd09-0b7b-4959-905b-f399a9bc1d2f", "data": {"original_file": "documents/3193dd09-0b7b-4959-905b-f399a9bc1d2f.docx", "redline_file": "documents/3193dd09-0b7b-4959-905b-f399a9bc1d2f_redline.docx", "suggestions": [], "original_filename": "nda1_original"}, "timestamp": "2025-05-20 21:19:58.930040"}]